{"podcast_details": {"podcast_title": "Muscle for Life with Mike Matthews", "episode_title": "Q&A: Restarting Training After a Break, Bicep Strength Imbalances, Gym Shaming, & More", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_nologo/5814648/5814648-1600189463901-8a3ca7651e997.jpg", "episode_transcript": " Hey, I'm Mike Matthews and this is Muscle for Life. Welcome, welcome. Thank you for joining me today for another Q&A episode where I answer questions that people ask me over on Instagram. So what I do is every week, usually Wednesdays, I put up a story asking for questions and people submit questions. I get a lot of questions. So if you have asked me questions and I haven't answered them, please don't take it personally. It would take literally hours to answer all of the questions. And so what I do is I go through them and I look for questions that are topical or just interesting to me, questions that I haven't answered a billion times already, and I answer them briefly there on Instagram. Then I bring everything over here to the podcast so I can answer the questions in more detail. And so if you want to ask me questions, find me on Instagram at Muscle for Life Fitness, follow me and then watch my stories, particularly on Wednesdays and Thursdays. And so in today's episode, I'm answering questions regarding how to return to training properly after taking a month or two or even three plus months off. I answer a question regarding DeSantis or Trump for 2024. I have a question here regarding women shaming guys for looking at them in the gym, if it's normal to be weaker on one side of your body, like your left biceps versus your right biceps and what to do about that. I share some of my favorite hamstring exercises that you can do in a garage gym. I share my thoughts on the carnivore diet and how you can modify it to make it a great diet and more. AbsoLight1997 asks, returning to training properly after one month vacation, anything that gets overlooked when starting back? Yes, the most common mistake that people do after an extended break, anything over, let's say, three to four weeks, is they just do too much too quickly, then they get extremely sore. Sometimes get injured. Your risk of injury does go dramatically up if you have taken a fair amount of time off and then you try to go right back into the gym and do exactly what you were doing before the break. Same training weights, same training volume, or maybe you have to reduce the weights a little bit, but same training volume. So same number of hard sets per workout per major muscle group per week. It can just be too much. So what I recommend is after one to two months off, come back into the gym, reduce your load by 20 to 30 percent. So those would be your pre break training weights. So 20 to 30 percent less weight on the bar and reduce your normal total hard sets per week. So what you were doing previously, your normal routine, reduce the total hard sets per week. This would be for each major muscle group by about one third. So you're doing about two thirds of your normal weekly volume with lighter weights. And if you then do that for a couple of weeks, you should be able to get right back to where you were right back where you left off. And if it's a longer break, you just need to be more aggressive in cutting the load and cutting the volume. For example, if you've been out of the gym for many months, you might need to reduce your training weights compared to where you were previously by 30, 40, 50 percent. And you might need to start with one half of or maybe even a little bit less of your weekly volume before the break. And then you might need to progress from that to something closer to what I just mentioned. So you start with 50 percent of the previous weekly volume, maybe even 50 percent of the training weights. Do that for a few weeks. You're feeling pretty good. You then increase your volume to two thirds of where it was at previously. Number of hard sets per major muscle group per week. And you then bump the weights up to maybe 70 to 80 percent of where they were at previously. Do that for a few weeks before getting back to 100 percent of your previous volume and training weights. OK, all cities Ferrari, Ferrari, DeSantis or Trump for 2024. Here's the real question that I would pose to conservatives. Given the current circumstances and the circumstances that you are concerned about, why do you think you can ever win another national election? For example, many conservatives will point to various anomalies that occurred in the 2020 election in certain key metro areas, in key states like Georgia and Wisconsin and Pennsylvania and elsewhere. And their argument is that these anomalies constitute circumstantial evidence of cheating and substantial cheating enough to swing the results of those states. And so if you are a conservative and if you had to just put your money down and look into the crystal ball, you would bet on that. You would bet that those anomalies were evidence of substantial cheating. And that is what happened. OK. So if that's your position, what exactly has changed in those states legislatively, particularly around election security and preventing something like that from happening again, that gives you confidence that your candidate has any chance of winning in the next election. If I were one of these conservatives and I don't consider myself a mainstream conservative, a conservative with a capital C, I think conservatism, Inc. is a joke and is essentially controlled opposition as just part of the uniparty group of gangsters and oligarchs who actually run this country and who don't exactly have our best interests in mind. But if I were a boomer conservative, then I would have to ask myself why I think any conservative candidate can win, why I think even Jesus Christ himself could win. And so anyway, coming back to the question of Trump versus the Santas 2024, at this point, my gut says it probably doesn't matter. Anthony Lanasa asks, is it necessary to do all the phases in BLS or can I stick with the layout in phase one forever? You could do phase one for an extended period of time. You could just repeat it if you are really liking it. But the main benefit of doing each of the phases of the program, as I have laid them out in BLS and Bigger, Learner, Stronger, as well as the workout journal that goes with it, which is called the Year One Challenge for Men, which I should have called the Bigger, Learner, Stronger workout journal. But hindsight is 20-20. So the main benefit of working through those phases is you're going to work through all of the exercises, so all the best exercises for each major muscle group. You're going to get experience with each of them. And that is also probably going to improve your results. And it's going to help you better program your training when you are ready to start doing that, when you want to venture out on your own. It helps to have a lot of experience with many different exercises and combining those exercises in different ways. And so those are some of the things I was thinking with when I created those phases. I wanted to make the first year of the program kind of like the training wheels phase of the program. So then you're ready to take off the training wheels after following my programming for a year and ride on your own. Becky Bellini asks, thoughts on all the chemical train derailment, what's going on? So this was asked several months ago. And although ironically, I did just see another headline about another train that derailed. I don't know if it was carrying chemicals. But anyway, a cursory review of all such disasters tells us that the company involved will always lie and always downplay the severity of the disasters and the media and the government will always parrot the same messages as the companies. So it's fair to assume that the evidence that this is worse than we are being told is accurate. And so if I lived in an area that was severely affected by one of these crashes, I personally would go to great lengths to leave at least temporarily. Again, knowing that I am going to be lied to if it's really bad. I'm going to be lied to. The company is not going to admit it. The media is not going to uncover it at least right away. And the government certainly is not going to tell me if they know. OK, CAA 1997 asks, thoughts on girls shaming guys for looking at them in the gym? Well, there are over sexed men in gyms who repeatedly stare and stalk. And those guys are pathetic, regardless of how the women are dressed. Yes, you can say that some women clearly want attention in the gym, and that's why they dress a certain way. And that's why they position themselves in certain areas. And even in some cases do certain exercises. But I don't think that excuses the behavior of some men who do take it too far. And what many of these men don't understand or don't want to understand is if women are interested in them in the gym, these women will probably make it known. They probably will make eye contact, hold eye contact, maybe smile, invite attention, invite maybe even conversation. But if they are not doing these things, they're probably not interested. Dan Cole 23 asks, is a weaker non-dominant bicep normal? I'm always weaker on my left side doing dumbbell curls. Yes, it is normal to have a weaker side of your body and to account for this. And it can be different with different muscle groups. But yes, it is normal to have one side weaker than the other. And to account for this, what you can do is you can start and end sets with your weaker side and don't do additional reps on your stronger side. So, for example, you would start with your left. Dan Cole would start with his left on his biceps curls, for example. And then let's say he gets eight reps on his left side. And he could do 10 reps on his right side. He would do just eight. So he would limit his volume of his right side to what his left side can do. And then he also could add one or two extra sets. In this case, it would just be a left arm biceps curl. Add one or two extra sets for his left arm every week. And slowly, the imbalance would correct. And then he wouldn't have to do the extra volume for his left and limit the reps on his rig"}, "podcast_summary": "The person speaking is Mike Matthews, the host of the podcast Muscle for Life. In this episode, he answers questions from his Instagram followers. He provides advice on how to return to training after a break and suggests reducing load and volume to avoid injury. He also discusses the political landscape for conservatives in the upcoming elections, shares thoughts on women being shamed for their appearance at the gym, and gives advice on dealing with imbalances in muscle strength.", "podcast_guest": "Mike Matthews", "podcast_guest_details": "Michael Scott Matthews (born October 24, 1973) is a former Major League Baseball pitcher who pitched from 2000 to 2005. Matthews graduated from Woodbridge Senior High School in Woodbridge, Virginia. \nMatthews pitched a single season at Montgomery Junior College in Rockville, Maryland in 1992 before being drafted by the Cleveland Indians in the second round of that year's amateur draft. In August 1999, he was traded twice in a single month, first to the Boston Red Sox organization, then to the St. Louis Cardinals three weeks later. He made his major league debut with the Cardinals on May 31, 2000.\nMatthews was a relief pitcher in the major leagues. He was traded to the Milwaukee Brewers toward the end of the 2002 season, signed as a free agent with the San Diego Padres for 2003, with the Cincinnati Reds for 2004, and with the New York Mets for 2005.", "podcast_highlights": "- The most common mistake people make after taking a break from training is doing too much too quickly, which can lead to soreness and injuries.\n- The recommended approach is to reduce the load by 20-30% and the total number of hard sets by about one third for each major muscle group.\n- For longer breaks, the reduction in load and volume may need to be more aggressive.\n- There is uncertainty regarding the 2024 elections and the ability of conservative candidates to win.\n- It is not necessary to go through all the phases in the BLS program, but doing so helps gain experience with different exercises and improve results.\n- In the event of a chemical train derailment, it is advisable to take precautions and potentially leave the affected area temporarily.\n- While some women may dress or position themselves in a way to seek attention at the gym, it does not excuse inappropriate behavior from men.\n- It is normal to have one side of the body weaker than the other, and it can be addressed by starting and ending sets with the weaker side and adding extra sets for that side."}