{"podcast_details": {"podcast_title": "AI Chat: ChatGPT &amp; AI News, Artificial Intelligence, OpenAI, Machine Learning", "episode_title": "OpenAI Makes First Acquisition & is Beating Stack Overflow", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/staging/podcast_uploaded_nologo/36533826/36533826-1690590009569-87bdf4899028d.jpg", "episode_transcript": " Welcome to the AI Chat Podcast. I'm your host, Jayden Schafer. Every day I break down AI news, interview guests, and explain the implications of AI in your life and business. Make sure that you go to AIBOX.AI, link in the show notes, to join the waitlist for our new AI platform. We're going to be launching an incredible platform that allows you to build anything you want with workflows in AI. So you're able to chain together chat GPT and image generators and audio generators to make really powerful apps for your organization, or you can host them on our marketplace and actually generate royalties from them. So make sure to go to AIBOX.AI and join the waitlist. In addition, if you like the podcast, if you can do me a massive favor and please leave us a review on Apple or Spotify or wherever you listen to your podcast. This helps me be able to get better guests on here as they check the reviews to see how you guys are liking it. So if you could please do that, I would really, really appreciate it. Have you ever wanted to start your own podcast? I record and publish this podcast on a platform called Spotify for Podcasters and I absolutely love it. Essentially what you can do is upload from your phone or computer and it distributes it to every platform that plays podcasts. They support video podcasts and you can make money on the platform with ads or even podcast subscriptions. It's something that has made my life so much easier as a podcaster. So if you're interested, I highly recommend you give it a try. You can download the Spotify for Podcasters app or go to Spotify.com slash podcasters to get started. Today on the podcast, we're going to be talking about a recent acquisition that OpenAI has made leaving us wonder, you know, why did they acquire this company? Was this something they were unable to do before? Was it something they want to scale up really quickly? We're going to be talking about that. In addition, we want to talk about the fact that it looks like ChatGPT may be winning over Stack Overflow. And we're going to be diving into that as well. So without further ado, let's jump into it. So OpenAI, of course, famous for ChatGPT, recently announced that it is acquiring Global Illuminations. This is a New York based startup that essentially uses AI to craft creative tools, digital experiences and infrastructure. The acquisition is the first for OpenAI in approximately seven years. This is a really big deal, right? This is the first company they've actually acquired. And details regarding the transaction terms are still undisclosed. We don't know exactly how much this was, you know, acquired for. But in a statement on their blog, OpenAI said, quote, the entire team has joined OpenAI to work on our core products, including ChatGPT. Global Illumination is the brainchild of founders Thomas Dimson, Taylor Gordon and Joey Flynn. And it has engaged in a whole bunch of projects since 2021 when it was first created. And notably, the venture received support from prominent VC firms such as Paradigm, Benchmark and Slow. So impressively, the minds behind Global Illumination had earlier played pivotal roles in product design and development at tech giants like Instagram, Facebook, YouTube, Google, Pixar and Riot Games. So while serving as the Director of Engineering at Instagram, Dimson significantly contributed to enhancing the platform's discovery algorithm. And his contributions at Instagram include the initiative of teams focusing on the Explorer tab, feed and stories ranking. So he also worked on IGTV and a couple other things, right? So obviously he's very well ingrained in tech and did a lot of big moves in some big products on some big platforms. So then that begs the question, right? What is Global Illumination actually going to do? So one of the latest offerings from them is actually Biomes, which is an open source sandbox MMORPG. It's reminiscent of Minecraft, but crafted from web platforms. So the game's future remains really ambiguous. And given the recent acquisition, it's possible that Global Illumination's endeavors under OpenAI's umbrella might veer away from entertainment focused projects and more towards other things. So the OpenAI has previously steered clear of acquisitions. I think the AI giant right now, they have a lot of money in venture capital from Microsoft and other VCs. And so they have been proactively funding and offering grants to different AI firms over the years. And I think evidently AI is strategically positioned in itself for a significant commercial breakthrough. And despite GPT-4's worldwide usage right now, I think OpenAI reportedly funneled over $540 million into development last year. So it's definitely spending very, very heavily to improve its core products. I think the investment also kind of encompassed the strategic hiring of top talent from competitors like Google, which obviously is not going to be super cheap. And in addition, while OpenAI's revenue touched $30 million in the year before, CEO Sam Altman has reportedly informed stakeholders about ambitious plans aiming to scale this figure to $200 million in the current year and envisioning a really robust $1 billion the following year, which could be impressive, but in order to pull this off, they're definitely going to need a lot more help. And it would appear that this new company they've acquired is going to help them do just that. Onto another piece of news, the fact that it would appear that chat GPT is beating Stack Overflow. So if anyone remembers where this was at the beginning of the year, Stack Overflow is the website that developers use to post questions and get responses on how to do code projects, how to develop different types of code, get code snippets. Now the problem is Stack Overflow saw a massive decline in traffic after chat GPT launched when people realized they could ask chat GPT for questions about coding to write code and all sorts of things. Stack Overflow took a massive hit in recent, just recently Stack Overflow has made a lot of changes to its settings saying that they are going to charge people to essentially use their data if they're going to train models because I believe chat GPT like trained with using Stack Overflow data, which is, you know, pretty tricky for Stack Overflow. And in addition, I believe they're training their own AI model for developers. But with all of that underway and all those announcements, it would appear in the, you know, the today in today's term that chat GPT may still be winning. So even with all of these super experienced data that Stack Overflow has, and I think it still is a really big tool data from an analytics firm in May said that the platform's traffic declined on average 6% in every month of the year, culminating to 17%, a 17% drop by April, right? So we're just seeing month over month, Stack Overflow's traffic is getting cut down due to chat GPT. So a study at Purdue University titled, Who Answers to be Better in In-depth Analysis of Chat GPT and Stack Overflow Answers to Software Engineering's Questions. It's kind of a long title, but in any case, the study suggests that they found a concerning trend. A notable chunk of chat GPT's answers to coding related queries were either misleading or downright false. However, in a comparison test, 40% of participants favored chat GPT's responses and were swayed by its really good response style. So of 512 chat GPT responses analyzed, a whopping 52% were flagged as incorrect and alarmingly 77% of those preferred by participants were inaccurate. So despite really glaring inaccuracies in chat GPT's answers, a subset of participants still lean towards them over Stack Overflow and Stack Overflow's responses. So Samina Kabir is the co-author of the study, she shed some light on this saying, participants overlooked the inaccuracies when they found chat GPT's responses insightful. Its confidence, articulate delivery style, even if misleading fosters user trust. So according to Kabir, the blend of this language really makes people like it. So while language models like chat GPT promise really quick answers, they are not always 100% accurate. So Stack Overflow recognizes these pitfalls and has prohibited chat GPT derived responses. You can't ask coding questions on chat GPT and post them on Stack Overflow, a lot of people are doing that right at the beginning of chat GPT. And I think that this is really interesting, right? Humans actually prefer it. Now, the other caveat I will say is a lot of times when you hear these kind of articles or these kind of studies and they're like, oh my gosh, 52% of the coding responses were inaccurate. That might be true, right? If someone says, and also let's, I'll define inaccurate, but you might say like, hey, code me something that does X, Y, and Z. It spits out some code. Now, a respondent might say, okay, this looks great. Pop it in to wherever they're developing and then they're going to go debug it. They're going to fix whatever is wrong. If you're kind of a semi-experienced developer, you're like, I just need something to throw something together for me real quick. I know it's going to be like referencing libraries that don't exist, whatever. I can go fix those and change those. And Stack Overflow might be more cleaner code that you could instantly copy and paste, but perhaps it's harder to find the result on Stack Overflow. I'm not a hundred percent sure, but what I will say is on the projects I'm currently working on, my developers literally say they cannot live without GPT-4 and that they use it every day. And also that they have like went away from Stack Overflow a lot. So like I see this in real time playing out across real companies. And I do think that, you know, while a lot of these studies are going to be saying, like, so it's funny because the, the like takeaway from the study is like, Chadg-GPD is winning. People prefer it. And then everyone's like, yeah, but it's li"}, "podcast_summary": "OpenAI's AI Chat Podcast is hosted by Jayden Schafer, who breaks down AI news, interviews guests, and discusses the implications of AI in everyday life and businesses. The podcast introduces a new AI platform called AIBOX.AI, which allows users to build apps using chat GPT, image generators, and audio generators. Users can either create apps for their organization or host them on the marketplace to generate royalties. The podcast also asks for listeners to leave a review to attract better guests. OpenAI made its first acquisition in seven years by acquiring Global Illuminations, a New York-based startup involved in AI tools, digital experiences, and infrastructure. The terms of the acquisition were not disclosed. Global Illuminations' founders have worked at major tech companies like Instagram, Facebook, YouTube, Google, Pixar, and Riot Games, with one founder having significantly contributed to enhancing Instagram's platform. Global Illuminations' latest project, Biomes, is an open-source sandbox MMORPG reminiscent of Minecraft. OpenAI's acquisition of Global Illuminations suggests a shift towards non-entertainment projects. Stack Overflow, a platform used by developers for coding help, has seen a decline in traffic since the arrival of chat GPT. Despite Stack Overflow's experienced data and modeling its own AI for developers, a Purdue University study found that chat GPT's responses to coding queries were often inaccurate or misleading. However, participants still preferred chat GPT due to its insightful and confident response style, even if the answers were incorrect. Stack Overflow has banned chat GPT-derived responses.", "podcast_guest": "Jayden Schafer", "podcast_guest_details": "None", "podcast_highlights": "- OpenAI has announced its first acquisition in approximately seven years, acquiring New York-based startup Global Illumination, although specific terms of the transaction were not disclosed.\n- The founders of Global Illumination have previous experience in product design and development at prominent tech companies such as Instagram, Facebook, YouTube, Google, Pixar, and Riot Games.\n- OpenAI's recent acquisition may indicate a shift away from entertainment-focused projects and towards other areas.\n- OpenAI has been actively funding and offering grants to AI firms, and aims to significantly increase its revenue in the coming years.\n- Stack Overflow has experienced a decline in traffic since the launch of ChatGPT, as users have preferred asking coding questions to ChatGPT over Stack Overflow.\n- A study by Purdue University found that while ChatGPT's answers to coding queries were often incorrect, participants still favored its responses due to its language style and delivery.\n- Stack Overflow has prohibited ChatGPT-derived responses due to the inaccuracies.\n- Real-world usage of ChatGPT indicates that developers find it useful in their everyday work and are relying less on Stack Overflow."}