{"podcast_details": {"podcast_title": "SPEAK YO MIND RADIO", "episode_title": "Backseat Rhymez", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_nologo/2538819/2538819-1655502121421-ec2cbc0dceb1f.jpg", "episode_transcript": " We're not against rap, we're not against rappers, but we are against those Something big bout to happen, I hear the beat tapping We some fly rummin' feelings reppin' on the track, better yet, grab a gap cause we hot like And those doors close, windows up, cause that's the way we like to ride, Windy City hittin' Check mic 1212, we live baby Hey guys, what's up and welcome back to Speak Your Mind Radio. I am your hostess with the mostest Queen star aka Ms. Hip Hop. And in today's program, it's gonna be real short, don't worry, I'm gonna just write a little poetry to you, you feel me? I actually went to this Hot Tuesdays talk and it was so cold y'all, we had so much fun with mad poets with mad talent all over the Chicagoland area It was just amazing, like literally, okay? So I'm so really happy that I found out about it because it literally brought me out of my shell to write this poem It's called Backseat Rhymes. The reason why I entitled it Backseat Rhymes is because I put my poetry on a back burner so therefore that's the backseat of my poetry. Let's get it. The pen in my ear is my poetry in full gear. I dream in metaphors, my rhymes shoot out like a continuum constellation of stars beaming high from the backseat. I crash and hit a wall. It all makes sense to me now. I'm full of heat, quite petite, added with a little conceit, don't hate, just skate, discrete dialect on full repeat. I said, I'm full of heat, quite petite, added with a little conceit, boom, now I'm ready to feast. Ride the rhymes like a skateboard beat, rise like yeast, like a priest meeting a deceased. I'm a beast. Wordplay hot like fellatio, stimulate the brain cells, study hard like every day. Neurology and numerology make up my psychology. I'm from the 1920s so I know how to swing things. I know it stings, but I know how to do many things. Just call me the head ball coach from the HBCU school. I ain't no fool. I use my head like a tool, make them all drool, have them sent back to preschool. The aromatic of my mathematics is incomprehensible and leaves you blown like a light fuse."}, "podcast_summary": "The speaker begins by asserting that they are not against rap or rappers, but rather against something unspecified. They mention that something big is about to happen and that they are representing on a track. They introduce themselves as Queen Star aka Ms. Hip Hop and welcome listeners to Speak Your Mind Radio. The speaker then briefly discusses attending a poetry event called Hot Tuesdays in Chicago and expresses how it inspired them to write a poem called \"Backseat Rhymes.\" They explain that they titled the poem this because they had put their poetry on the back burner. The speaker then recites their poem, which uses vivid imagery and wordplay to convey their passion for writing and their confidence in their skills. They describe themselves as unique and knowledgeable, and conclude by mentioning the impact their poetic style has on others.", "podcast_guest": null, "podcast_highlights": "- The speaker is not against rap or rappers.\n- They attended a Hot Tuesdays talk and had a great time with talented poets from the Chicagoland area.\n- The speaker was inspired by the event and wrote a poem called \"Backseat Rhymes.\"\n- The poem reflects the speaker's personal journey with poetry and their passion for it.\n- The speaker describes their poetic style using metaphors and wordplay.\n- They express confidence and self-assuredness in their poetry.\n- The speaker relates their knowledge of neurology and numerology to their understanding of psychology.\n- They reference their connection to the 1920s and the ability to excel in various areas.\n- The speaker uses their intelligence and skills to impress others and make them envious."}