{"podcast_details": {"podcast_title": "Hacking Humans", "episode_title": "AI versus AI.", "episode_image": "https://megaphone.imgix.net/podcasts/8797f03a-a50b-11ea-b6c0-87ebb093948d/image/hh.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " You're listening to the CyberWire Network powered by N2K. By using AI, we can put together enough signals to be able to know with certainty and with a high degree of confidence who really is at the end of a transaction. Hello everyone and welcome to the CyberWire's Hacking Humans podcast where each week we look behind the social engineering scams, the phishing schemes and criminal exploits that are making headlines and taking a heavy toll on organizations around the world. I'm Dave Bittner and joining me is Joe Kerrigan from the Johns Hopkins University Information Security Institute. Hello, Joe. Hi, Dave. We've got some good stories to share this week and later in the show, my conversation with Blair Cohen. He's founder, president and chief evangelist at Authentic ID. We're talking about the notion of using AI to battle AI. But first, a word from our sponsors at KnowBefore. Even if you don't know it, your organization has a security culture. We should all strive for a strong one with users reporting phishing emails as soon as they see them and discussing the latest newsmaking data breach around the water cooler. But we also live in the real world. Many organizations likely have a security culture that could use some improvement. KnowBefore has been leading the push to improve organizational security cultures through new school security awareness training for a little more than a decade. Stay with us and in a few minutes, we'll hear from our sponsors at KnowBefore about a new way to build your security culture to be the best it can be. All right, Joe, we have some follow up before we jump into our stories here this week. We do indeed. What do we got? Robert writes in and says regarding the episode from August 3rd, which was like two episodes ago with the interview with Raj from Trua. Shortly after listening to the episode, I ran across this new product online and the headline says, world's first chat GPT powered voice recorder snaps to your iPhone records, calls, summarizes meetings. And I went to the website and it is, it claims to be exactly what it says in this headline that you can slap it on the back of your phone. It'll listen to everything, transcribe everything and record everything, does voice recordings, it'll record lectures and summarize transcribe and summarize everything for you using chat GPT. Bob's first response was, well, something we can't say on a family show starts the word holy. Can you imagine this device recording every call or conversation you have and that content being out of your control for the rest of the time, absolutely dystopian and terrifying. Your podcast should be mandatory listening. Keep up the great work. So yeah, I mean, first off, my thinking on this is you really better be careful when you're doing this because if you don't notify people that you're in, that you're recording their phone call and you're in a state like Maryland, we're a two party consent state, right? They, you're violating the law just recording somebody, even if it's just to transcribe them. Right. So yeah, I don't, I don't, I don't know. I don't know how I like this thing. It is an odd device. I mean, it looks like, you know, those, those little sleeves you can put on the back of your phone to hold your credit cards. That's exactly what it looks like. Yeah. It looks like one of those except inside the sleeve is a little, and it may be, but that may be part of it because it looks like there's a little device about the size of a credit card that slides in there that I guess is the recording device. What's interesting to me is that, I mean, this is a sort of a brute force work around to the fact that at least on iOS, like Apple is really deliberate about you not being able to directly record phone calls. Right. There are no apps that can do that. That is just against Apple's rules. That's interesting. So yeah, yeah. So this is, you know, like I said, it's an end around to do that. So that's problem one. So as you point out, but also as we said in that previous interview, you don't want to be just sending everything up to chat GBT because it becomes part of their corpus of information and people can ask about it. Yeah. I actually did a little research in this recently. The, the open AI terms of service says that they don't use your input to train the model. Oh, okay. But that doesn't mean they don't get your input and they don't keep your input forever. Right. Right. Right. So, I mean, there's nothing, nothing about that, about that, that said, we don't use your input to train our model. We still have it. We train a different model. You still basically uploaded it to a stranger. Right. Yeah. Yeah. You've uploaded it to a stranger. Exactly. Right. Right. No, it's, it's really interesting. So thank you, Bob, for sending in your kind note. We do appreciate it. That is a, that's a heck of a product there. We'll have a link to that in the show notes. All right. Well, let's move on to our stories here. I actually have two stories for us this week and the first one is a personal one. Okay. I got a call from my father. Okay. How's your dad doing? He's doing, he's doing great. Okay. Overall, he's doing great. But I got the call that we all get, those of us who are in tech, Dave, the computer's not working. Right. So can you come, can you come fix the computer? Actually, can you help me fix the computer? I'm like, there's no way I can diagnose your computer from over the phone. I'll be over there this afternoon. Yes. As well as all these things popped up on the screen and it says that the computer has been locked and it shut down and I have to call Microsoft tech support, you know, right away and windows defender. And now there are all sorts of alarm bells going off in my head because first of all, my father has a Chromebook. Huh. It doesn't have windows defender. So he just went to a, he just went to a website that threw up all this stuff. Exactly. Exactly. So I dropped by to visit with my dad and then get it worked out. And sure enough, there's his computer and it has every visual alert that you can imagine is going on on this computer. So there's pop ups that say this computer has been locked in order to unlock it. We must call Microsoft now. There's like a, what do they call it? A crawl at the bottom of the screen. You know? Yeah, exactly. It's saying like, you know, 47 viruses detected, you know, danger, danger, right? And it's just everything. Right. So I say, okay, obviously this is a scammer, you know, what her dad happened upon a scammer website. Who knows what it was. It may be a legitimate website that's been hacked. Absolutely. I'm pretty sure that happened to my mom once. Could be. So now I go through the dance of trying to close all these windows, which they're not going down without a fight. So I, I'm trying to click on X's as fast as I can. You know, it's like playing a, I don't know, it's like an eighties arcade game, you know, and I'm having no luck with this at all. It's like defender, but you don't have a smart bomb. Exactly. That is a great way to describe it. So what I end up force restarting the machine. And then as quick, like as soon as Chrome comes up, I'm just like, close all windows, close all windows. Do you want to start where you left off? Oh God, no. No, no, no. So, so we got them up and running again. And you know, I installed a privacy badger on his browser, which is the EFFs, basically the EFFs, F's very sort of set it and forget it. You know, anti-scammer, anti-ads kind of thing. It's very lightweight. It's a Chrome plugin. Yeah. Okay. Very lightweight, easy to use. It comes from the EFF who, you know, they have a reputation I trust. And so, you know, we'll see, hopefully that'll help, you know, sort of shame on me for not having something like that already installed. But you took the right step in getting them a Chromebook. Yeah. Thank you. That's number one. Yeah. But you know, what's going to happen here, if he calls any of these numbers is they're going to ask him for a credit card and they're just going to charge a credit card out the walls. Right. Right. Exactly. And that's, that's the scam. Yep. Yep. And there's no amount of security product that you can put on a computer that will stop from happening once he picks up the phone and dials the numbers. True. So true. Yeah. I'll just note as a side thing, you know, for, for the longest time, I would always recommend, you know, Macintosh computers for folks who are not computer savvy. Right. My parents, my, you know, my friends, family and loved ones, basically people who I would be doing tech support for. Yeah. Part of that was because I'm more familiar with Macs than Windows. So it was in my own self-interest, but also, you know, they just tend to not have as many issues, all that kind of stuff that, you know, everybody we've covered many, many times. I don't do that anymore because Chromebooks are so bulletproof. They're so cheap. Yep. You know, if this, if worse came to worse with this, I would throw away the Chromebook and buy my dad a new one. Right. And then have him log back into his Google account and everything's there. Exactly. So they're practically disposable. I've been a lover of Chromebooks for, for a long time. I got my kids Chromebooks when my son started high school and my daughter was like, I am never using this. Yeah. But my son was like, well, I'll use it. And he, he kept using it. And one day he said, I can't do any of my homework because my Chromebook is broken. I said, Oh no, no, no, no. You go downstairs to your PC and log into your account in a Chrome browser window and all of your stuff will be right there. Right. And he was like, dang it. Now I have to go do my homework. He was actually relieved. He thought everything was gone. Ah, yeah. But no, it wasn't gone. It was in the cloud. Right. So, you know, he thought it was on the, on the Chromebook and it isn't, it's, it's not, it's stored in, in Go"}, "podcast_summary": "In this podcast episode, the hosts discuss a personal experience with a tech scam. The host's father encountered a website or pop-up that claimed his computer had been locked and instructed him to call Microsoft tech support. The hosts recognized this as a scam and helped resolve the issue by force restarting the computer and installing a browser plugin called Privacy Badger. They also discuss the benefits of using Chromebooks for users who are not tech-savvy, as they are affordable and secure. The hosts also mention the potential dangers of calling the scammer's number and providing credit card information. Overall, the episode serves as a reminder to be cautious of tech scams and to use secure devices and software.", "podcast_guest": "Blair Cohen", "podcast_guest_details": "None", "podcast_highlights": "- The speaker received a call from his father asking for help with his computer.\n- The computer had been locked and displayed multiple pop-ups claiming to be from Microsoft.\n- The speaker determined that it was a scam and force restarted the computer to get rid of the pop-ups.\n- The speaker installed privacy badger on his father's browser to prevent future scams.\n- The speaker recommends using Chromebooks for non-tech savvy individuals as they are more secure and easy to reset if needed."}