{"podcast_details": {"podcast_title": "SPEAK YO MIND RADIO", "episode_title": "They Cloned Tyrone/ Tupac", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_nologo/2538819/2538819-1655502121421-ec2cbc0dceb1f.jpg", "episode_transcript": " We're not against rap, we're not against rappers, but we are against those Something big bout to happen, I hear the beat tapping We some fly rummin' feelings reppin' on the track, better yet, grab a gap cause we hot like And those doors close, windows up, cause that's the way we like to ride, Windy City hittin' Check mic 1212, we live baby Phone Ringing Yo yo yo yo, what's happening Chicago and welcome back to episode 464, Speak Yo Mind Radio I'm your hostess with the mostest queen star aka Miss Hip Hop And today is Friday, August 11, 2023, it's about like 81 degrees outside And in this program we will be discussing in 2023 mystery and fantasy film, they cloned Tyrone And also talking about the late and great rapper Tupac Shapoor on his 2001 track Letter to My Unborn From the album Until the End of Time But first, let me introduce my very fly guest back on the show, G Walker from the CNG Sports Podcast in Chicago Hey guy, how are you? Hey what's going on, how you doing? I'm glad to be back, I'm hyped, I'm excited, let's do this That's right man, for sure, we about to have a good old time, let's get it Yeah Alright, so you know how we do traditional Icebreaker Quest for you, so let's get it Alright Would you, no, no, what song to you, in your opinion, screams nothing but hip hop to the core? Man, I hate to be the, I don't want to be the, man, it'll have to be Will It Reminisce Over You Damn About E Rock and C.L. Smooth, it just comes on with this It's like the perfect track with the training, reminds me of Chicago in the 90s It's just such a beautiful produced sound, like the sound of that track alone doesn't even need nobody rapping on it Like that beat by itself, it's just so great and it's just one of the best beats of all, it's such a hip hop beat If I could put a beat in a time capsule, it'd be that beat right there That song took the cake, I mean, there's a lot of hip hop in the 90s There's a lot of hip hop songs that can get honorable mentions, but that's definitely one by Pete Rock and them That's just, that's incredible for real Yeah Man, I'm gonna have to even say for myself Eminem Infinite, that song screams pure freaking hip hop all day long It oozes hip hop to the core, like straight up, you feel me? Yeah, it does, that's another good one too, I can't disagree I can't disagree, you know your stuff, you know your stuff For sure, so speaking of what, let's go ahead and jump straight into the music, guy So, yo, Tupac Shakur would be like 51 years old today and still worth freaking millions of dollars, you know what I'm saying? Yeah But yeah, let's talk about the Rap Icon single, Letter to My Unborn I think that this song right here is like literally funny and iconic to me because like Tupac, I don't know, he didn't like have kids or anything like that So that's one reason why it's ironic and then on top of that, you know, he's always, to me he's always referenced his dad in all, you know, the songs that he did speak about him as dead And we know that, you know what I'm saying, he was not dead, so it's just like that's ironic right there and also manifesting that life and death in the tongue as you speak, you know what I'm saying? Absolutely, yeah, yeah The track was just the words, the lyrics, you know Pac was a very thoughtful person, you know, he was a very prophetic person So the fact that he could continue that type of, you know, type of message and imagery, you know, about not having kids and about his father not being around and being a better man and mama I want to make it on my own out of handout, you know what I mean? Things like that, he was saying so much in a little bit of time in the record and that was one of his great skills that he could put something so potent in the record, it didn't have to be over lyrical, it was just super real It was just an amazing way, it was just an amazing song I'm going to quote one of the lyrics Hold on, give me one second For sure, for sure It says, it says, will I raise my kids in the right or the wrong way? It says, dear mama, my man, I want to make it on my own out of handout Make way for a world win prophesized That last part, make way for a world win, you know, Papa's living a fast life, you know what I'm saying? That's one of the great things about him as a person, he was able to work so much and do so much in a short amount of time And he was prophesizing that he wouldn't have kids and he would die young So the fact that he put this song out with such crazy lyrics is unbelievable, man, like this might be one of the best written songs I've ever heard It says, one more and I'm going to let you get back to what you were doing It says, never ever since my birth, I've been cursed since I've been born to wow In case I never get to holla at my unborn child Here's many things learned in prison, blessed to still live and trying to earn every penny that I get And he's like, he left us a song to some kids he would never have Exactly Are these kids metaphorically he's talking about? As far as like hip hop kids of the next generation? What you think before we get to the next piece? No, that's definitely what he was doing, which brings me to ironic number three Like, yeah, he didn't have kids, but he was leaving a message for the youth, the generation of kids to come Because what Pac did, like Christ did, was come back to life again His lyrics were like literally Bible verses, like people would say Kanye West's lyrics when he first started It was straight poetry, but like I'm saying, their proverbs, their parables, you know what I'm saying? Everything of the Bible, everything that is holy, you know what I'm saying? It's the holy grail So that's how he was able to come back again, like Christ believed in his residence behind of rhyming and the poetry and everything I gotta agree, like that was such a, and then the sample with Michael Jackson and the Librarian Girl beat it It was an unbelievable song, and I can't think of a more potent song and a more unbelievable written song with a message like that Yeah, that was a good fact that you brought up, that the sample was that of Michael Jackson, Librarian Girl on his Bad album in 1987 So the fact that you brought that up is that Michael Jackson has been one of his biggest influences in music And a lot of people wouldn't know that unless they, you know what I'm saying, studied the scientific method of music, you know what I'm saying? Because there's Michael Jackson all up in there, period Yeah, and just one little quick little thing about that whole song, Pac actually had an opportunity to record with Michael Jackson But Michael Jackson didn't want to come to the studio, and Pac took offense to that He didn't want to record in the studio with Pac, so Pac didn't have the record, Pac could never do the record Because he felt like it was disrespectful, if you want to do a record with me, how come we can't be in person? So that's actual fact So they posted it again, actually made music together, but MJ didn't show up to the studio session He wanted to send his voice over and his lyrics over, and Pac wasn't with it, so he didn't want to do it Yeah, that's insane, I'm gonna just touch on that for a minute and say that's crazy Like who knew that Tupac and Michael Jackson could have gotten a song done together Had Tupac been on his high horse, so to speak, you know what I'm saying, you can't tell people how to feel I guess I was talking for you, he was just always in his feelings about something Right, because he even had a song on the album with the Letters to My Unborn called Until the End of Time I mean, the End of Time album was called Niggas Nature That was a good one too, yeah Yeah, In Terms would just be like the hood version of human nature That's a very good point, I never thought about it like that, that's deep, I like that Yeah, right, but we can move on, let's jump into the film, right? Okay, cool So they cloned Tyrone, the cast y'all know was Jamie Foxx, John Boyer, Tiana Paris, you know what I'm saying They played Fontaine, Yo-Yo, and Slick Charles So I just want to ask you, what you overall think about they cloned Tyrone? My overall thought of that movie was it was very subliminal, it was good It just made you think about are they really cloning us because one, let me just tap into this And this might have been a great marketing thing about Jamie Foxx, he went away, he got sick and people were saying he was cloned Then the next thing you know the movie comes out of how people are being cloned So let's just start there, so that might be the greatest promo ever But then we actually get into the actual film, it just makes you think are we actually being cloned? Because it's just hard to imagine that but at the same time it's really not in a way of like The things that are being processed in our food, the chemicals, the things that's in our hair, the hood People dying in the hood and still making babies in the hood and not uplifting the hood about buying property And staying together with the, instead of being a baby mother or a baby father, you become a husband and wife So you grow generational wealth through your family, through your seeds So the clones can be the things that we're doing within our own community which are leading to our own demise So just because you have a little Antoine or a little BJ or somebody like that, he gets killed But then it's another BJ and another Antoine or being born, you know what I mean? Yeah, that's basically the thing behind the clone Tyrone, everything to sum up in a nutshell is that Yeah, Tyrone is basically the representation of the Black community, you know, the average Black man so to speak Which brings me to an existing point within the music, they used Erika Badu, who's Tyrone To promo the idea of the film which was, I think they called it Tyrone So she re-recorded the words and the lyrics to promote the mind control, the systematic things that they have put in the movi"}, "podcast_summary": "The passage begins with a radio host introducing her guest, G Walker, and discussing hip hop songs that represent the genre. They then transition to discussing the late rapper Tupac Shakur and his song \"Letter to My Unborn,\" praising its powerful lyrics and messages. The conversation then shifts to talking about the film \"They Cloned Tyrone,\" with the host expressing her thoughts on the subliminal messages and themes of cloning within the movie. The guest brings up the idea that cloning might be a metaphor for the negative influences in the Black community, such as processed foods, chemicals, and lack of unity. They also mention how Erica Badu's song \"Tyrone\" was used to promote the film.", "podcast_guest": null, "podcast_highlights": "Highlights:\n- The discussion is about the mystery and fantasy film \"They Cloned Tyrone\".\n- The film features Jamie Foxx, John Boyega, and Tiana Paris.\n- It raises questions about the possibility of human cloning and the effects of chemicals and societal issues in the Black community.\n- Tupac Shakur's song \"Letter to My Unborn\" is discussed, highlighting its powerful lyrics and themes.\n- The song references Pac's lack of children and his prophetic nature.\n- The sample used in the song is from Michael Jackson's \"Librarian Girl\".\n- There was a missed opportunity for Pac and MJ to collaborate on a song.\n- Jamie Foxx's illness rumors and alleged cloning are mentioned as possible marketing tactics for the movie."}