{"podcast_details": {"podcast_title": "Easy Natural English with Liam", "episode_title": "Language without Numbers?", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/staging/podcast_uploaded_nologo/2977919/2977919-1691110591095-685c6300b54b8.jpg", "episode_transcript": " Easy Natural English with Liam. An English listening podcast. Hello everyone and welcome back. I hope that you're all doing well. Today I'll be picking up another topic to talk to you about that hopefully you will find interesting. And being as all of you listening to this podcast are learning English, I assume that you are all interested in languages. So today's topic is going to be about a particular language and also about the people that speak that language. And this is a very interesting group of people or in this case a tribe. A tribe is a word that we use for a very small group of people that live together. Compared to for example a country where you have the citizens, a tribe is usually a very small collection of one type of people. In this case today we are talking about a tribe that lives in the Amazon rainforest. And the reason I would like to talk about this tribe and their interesting language is because they are quite well known for apparently not having a system for counting. Not having words for numbers and not really engaging with the concept of counting and numbers. You might have heard of this group before. They are called Piraha. I'm not sure if that's exactly the correct pronunciation but that's how it seems to be pronounced when people are talking about it in documentaries and things like that. But this tribe or these people called Piraha, they are very well known for having an unusual language, at least unusual when looking at it from the perspective of for example someone like me who speaks English seems to be very different. So a few things that make it different from the languages that I'm used to and probably the languages that you are used to as well is apparently it doesn't have exactly a present future past tense system. Apparently they tend to speak in only present tense. And a lot of things today when I talk about this tribe I will say apparently and you know we use this word apparently when we mean that somebody said this but we don't know if it is 100% true or not. So if your friend tells you about something and you're not sure if that's exactly true, then you might start by saying apparently blah blah blah. And the reason I'm using this word apparently a lot today is because a lot of what we know about the Piraha language comes from one man. His name is Dan Everett or Daniel Everett. And the reason it comes from him is because this tribe, there are only 700 members of this tribe, and they live deep in the Amazon rainforest. They don't have that much connection with the rest of society. And this Dan Everett is one of the very few people who have tried to make a connection with this tribe and has spent the time to learn their language. There are a few people that speak a bit of their language, but he is the most fluent. So a lot of what we know about their language comes from this one person. And because many claims of their language seem quite surprising to linguists and to the rest of us compared to what we know about existing or compared to what we know about other languages, his claims are quite surprising. And because he's the only one that can say these things, that can clarify these things, there are a lot of linguists who say, I'm not sure if that's true. That's interesting, but we don't know if that's exactly true or not, because we need to put a lot of trust in this man. It seems like from some of the other people that speak this language that what he says might be true, but we don't know 100%. So I will be using the word apparently a lot today. So as I was talking about just a moment ago, one of the things that is interesting is the way that people in this tribe talk about tense or talk about time. And one of the famous things, which I also mentioned right at the beginning, is that they don't have a system for numbers. And that is one of the main things that I want to talk about today. So let's get into today's episode. Until about 30 years ago, most linguists agreed that all languages have numbers, that numbers and counting were a universal thing. And this makes sense, I think, if you like me, and I'm sure all of you are like me in that you come from a culture and a language that uses numbers and counts things. And counting and numbers and maths are such an everyday thing for us that we can't really imagine our lives without. So I think without researching too much, a lot of people would just assume, would just guess that every language and every culture uses numbers. However, in the early 2000, Dan Everett, the man that I mentioned earlier, the linguists who had connection with this tribe through interaction with them. He started to learn their language. Of course, it had to be through just interaction, because unlike a language, for example, like French, he could not just go to a bookstore and buy a book called Beginner's French, because nobody outside of this tribe had tried to learn this language or document this language. So, of course, like a lot of people that have this kind of this kind of occupation where they try to document new languages. The only approach they can take is to spend time with these people and try to understand their language. And as he learned more, he started to realize that they didn't use numbers. So he did some kind of experiments or some kind of observations with these people, and he would lay out a few items. So I saw a video, for example, where he had fish hooks and he put down one fish hook and he asked one of the tribe members, how many is this? And the tribe, the man from the tribe, he used the word, which is something it's H O I. And so I think it's pronounced something like OI. And apparently this word, according to Dan Everett, doesn't exactly mean one. It just means a few or not many. So he asked the man in the tribe and he's done this with other members. This is just one video that I was watching. But he's done this kind of experiment with many members of the tribe. He asks, how many is this? And the man just answers, not many. And then he puts one more and the man might say, yeah, that's not many. And then when he puts a few more, the man will change the word and he'll say, oh, it's a lot or like it's a collection. So they don't exactly specify one, two, three, four, five. They speak more in terms of not many or many. So then after Everett realized this, a question he asked himself and a question that you might be asking yourself now is, can the Piraha people actually comprehend numbers? Although they don't have the words for numbers, are they able to count? So a way that he checked this is he laid down a few items similar to what I was explaining before. So, for example, like fish hooks, he would put down two fish hooks and then ask the person opposite, one of the members of this tribe to do the same. And he said, if it was one or two fish hooks, they would usually copy. So if he put down one hook and he said, please do the same, they would put down one hook. If he said, if he put down two hooks and he said, please put down the same as me, they would put down two hooks. But he said, once it got over two, once it started to be three, four, five, six, seven, eight, he said, the larger the number, the more likely they were to make mistakes. And they didn't exactly match the amount of hooks or batteries or whatever he was using at the time. They didn't match exactly the number that he did. And it was for any number over three, they started to make mistakes. So it wasn't some big number like forty eight or something that would be hard to look at quickly and copy. It was just a number, for example, like seven, eight, nine that would start to be difficult for the people, which would suggest that they didn't quite use the concept of numbers in the same way that we are used to. And this was what Everett referred to as an analog estimation strategy. And estimation means like a guess means, for example, if I threw a handful of coins on the floor and I asked you how many coins is this, if you went one, two, three, four, five and counted, that is not estimating. But again, if I threw the handful of coins on the ground and you said, it's about 17, you just look and quickly guess that is estimating. So that is what he thought that people in this tribe were doing because they didn't have this system in their mind of counting one, two, three, four, five. They would just make a kind of estimation. So perhaps the next question you're asking yourself is why don't they use numbers? Don't they need them? But as I mentioned earlier, they are a very small tribe. It's thought that there are about 700 people in this tribe these days. And their way of life is what we in the kind of life that we live, we might consider it to be a simple lifestyle. Apparently, they don't store food for very long. Apparently, they tend to collect food and eat food pretty much on a kind of instant basis. They said that if they make some flour from some of the local plants, they will usually use the flour within two or three days. So a lot of what they're doing doesn't require large numbers or doesn't require counting. You know, their day to day life is when it comes to food would just be simple as seeing something that you want to eat, collecting it, harvest, you know, collecting it, preparing it and then eating it. So that's a very different style of living than what we're used to, where I'm sure most of you listening go to the supermarket. And in the supermarket, they need to keep track of how many, for example, how many packs of eggs they are selling every week. They need to make sure that they have enough eggs stocked for the amount of customers that they have. They don't want to have too few. They don't want to have too many. And they need to keep track of this kind of things with numbers. And now you might have made the connection with what I talked about earlier as well when I said that according to Everett and other people that have studied this language, thes"}, "podcast_summary": "In this podcast episode, the host discusses a particular tribe called the Piraha who live in the Amazon rainforest. The tribe is known for their unique language, which is different from most languages, including not having a system for counting numbers. The host mentions that there are only 700 members in the tribe, and their language has been studied by linguist Dan Everett, who is considered the most fluent in their language. The host explains that the Piraha language does not have a present-future-past tense system and uses a word that means \"not many\" instead of specifying numbers. Everett conducted experiments with the tribe members to see if they could comprehend numbers, and found that while they had difficulty with higher numbers, they were able to estimate quantities. The host suggests that their simple lifestyle, where they collect and eat food on an immediate basis, does not require the use of numbers.", "podcast_guest": "Dan Everett", "podcast_guest_details": "Daniel Leonard Everett (born 26 July 1951) is an American linguist and author best known for his study of the Amazon basin's Pirahã people and their language.\nEverett is currently Trustee Professor of Cognitive Sciences at Bentley University in Waltham, Massachusetts. From July 1, 2010 to June 30, 2018, Everett served as Dean of Arts and Sciences at Bentley. Prior to Bentley University, Everett was chair of the Department of Languages, Literatures and Cultures at Illinois State University in Normal, Illinois. He has taught at the University of Manchester and the University of Campinas and is former chair of the Linguistics Department of the University of Pittsburgh.", "podcast_highlights": "- Introduction to the topic of the Piraha tribe and their language\n- The tribe is known for not having a system for counting or numbers\n- Linguist Dan Everett has spent time studying the Piraha language and has made claims about its unique characteristics\n- The Piraha language does not have a present future past tense system, only present tense is used\n- Everett's claims about the language are sometimes met with skepticism, as he is the main source of information about the tribe and their language\n- The tribe uses words like \"not many\" or \"a lot\" instead of specific numbers\n- Members of the tribe are able to copy a small number of items accurately, but make more mistakes as the number increases\n- The Piraha people use an analog estimation strategy instead of counting\n- The tribe's simple lifestyle and immediate food consumption does not require the use of large numbers or counting"}