{"podcast_details": {"podcast_title": "FOX on Tech", "episode_title": "iPhone Slowdown Settlement", "episode_image": "https://megaphone.imgix.net/podcasts/f1a6776c-74e9-11ec-84b4-3f0a18d7613c/image/image.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " Fox on set. Longtime owners of Apple's iPhone may receive a payday related to the slowdown of their older devices. Apple's set to pay up to a half billion dollars to about three million users of pre-2018 phones. The settlement affects users who filed claims against Apple in 2020 regarding battery life on their phones. Those phones had low capacity batteries that would wear out over time like most current technology. And iOS updates purposely slow down the performance of those phones. Apple said at the time the reason for the so-called software throttling wasn't to deceive customers into purchasing newer models, but instead to prolong the life of those old phones. Owners of the iPhone 6 and all of its varieties, the 7 and 7 Plus, who filed claims before October of 2020, are potentially eligible to receive a check. The settlement not an admission of any wrongdoing, according to the claims website. With Fox on Tech, I'm Jeff Monasso. Fox News."}, "podcast_summary": "Apple is set to pay up to $500 million to around three million users of pre-2018 iPhones as part of a settlement related to the slowdown of older devices. The settlement affects users who filed claims in 2020 regarding battery life issues on their phones. These devices had low capacity batteries that would deteriorate over time, and iOS updates deliberately slowed down their performance. Apple claimed that the software throttling was meant to prolong the lifespan of these iPhones rather than manipulate customers into buying newer models. Owners of iPhone 6, 7, and 7 Plus models who filed claims before October 2020 are potentially eligible for compensation. The settlement is not an admission of any wrongdoing.", "podcast_guest": "Jeff Monasso", "podcast_guest_details": "None", "podcast_highlights": "- Apple is set to pay up to $500 million to approximately three million users of pre-2018 iPhones.\n- The settlement is related to claims filed in 2020 regarding battery life issues on these older iPhones.\n- The affected iPhones had low capacity batteries that would degrade over time.\n- iOS updates intentionally slowed down the performance of these phones.\n- Apple claimed the software throttling was meant to prolong the life of the older iPhones, not to deceive customers into buying new models.\n- Users of iPhone 6, iPhone 7, and iPhone 7 Plus who filed claims before October 2020 may be eligible to receive compensation.\n- The settlement does not imply any admission of wrongdoing by Apple."}