{"podcast_details": {"podcast_title": "The Hustle Daily Show", "episode_title": "Kidfluencers’ Illinois payday", "episode_image": "https://megaphone.imgix.net/podcasts/cab36112-749c-11ec-9974-57a8480b9bef/image/THDS_Final_Tile.png?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " Good morning everyone. It is Friday, August 18. I'm Juliet Bennett-Ryla here with Ben Berkeley and this is the Hustle Daily Show. Today we're going to talk about child influencers and a new Illinois law that ensures they get paid for the content that they make. But first let's talk about what else is happening in the world of business and tech. First up, the Associated Press, which has a licensing agreement with ChatJPT, published its standards for AI use. It's a lot of not surprising things like let's not use AI to alter media such as audio or photos and also don't use ChatJPT to produce publishable content. I will say the line that just thrills me as a media person is where they say, quote, we do not see AI as a replacement of journalists in any way. Feels like the kind of thing that you're going to refer back to in a couple of years and be like, well, that was fun when we thought that was true. Yes, yes. Blue Shield of California is tapping Mark Cuban's Cost Plus Drug Company and Amazon Pharmacy to save on patient costs. That means it's taking some of its business away from CVS. CVS had an interesting day today as we are recording this, its stock had dropped about 9 percent. So not a great day for CVS, but a great day for people who hate going to CVS like me. New York City is the latest government to ban TikTok on government devices that is effective immediately. Ben, I think you said you noticed something interesting about a New York City TikTok account. I did. If you look at the NYPD's account today on TikTok, which was being used for public safety notices, a pretty important thing to use social media for. Right. Now that NYPD TikTok account, it's no more. You know, I think there's obviously a lot to be said for security of government information. However, there is an impact that could be felt by the general population. Yeah, absolutely. And I'm kind of wondering where those accounts will go. Moving along, In-N-Out owner Lindsay Snyder's new book claims that the average In-N-Out manager earns $180,000 a year or more. And that's significant because apparently the average fast food manager makes about $63.8 thousand a year. So an In-N-Out manager on average makes like triple that. Yeah, for those interested, just want to know it would be in-n-out.com slash employment. Also in sort of like the fast food space, but not really gig workers. We're talking door dashers, Instacart, etc. They have been using Google Maps to mark tip baiters. So what they do is they'll be like, I'll tip you, let's say, $15. And then a door dash will be like, hell yeah, I want $15. I'm taking this thing. Do the assignment. They complete the delivery. And then because the user has the option to edit the tip afterwards, they will edit it down to be like, I'm actually only tipping you $2. So that's a tip baiter. And these gig workers are now trying to use Google Maps to warn other drivers like this person will not tip what they promise. Wow, I know Google is not allowed to do this and I know it's technically not a crime. I wouldn't be opposed to this map just getting in the hands of the police and all these people being sent to jail. It's rude. It's extremely rude. And last but not least, Indiana Jones, as you may recall, hates snakes. Harrison Ford, the actor who of course plays Indiana Jones, does not and is honored to have a new Peruvian species named after him. It's something that I'm not going to be able to pronounce. It's like the tachymenoidous Harrison Ford guy. That is the snake. Of this achievement, the actor said, the snakes got eyes you can drown in and he spends most of his day sunning by a pool of dirty water. We probably would have been friends in the early 60s. That pronunciation was incredible. I'm agreeing with Indiana Jones on this one. They're awful. And that's also probably growing up in a state where a lot of them could kill you. I think they're really cute, honestly. We will agree to disagree on this one. But I think on the top story today, something tells me we're going to have a lot more agreement. Yes, our top story today is about child influencers and a new Illinois law that is going to make parents pay them, essentially. So when you think about a child influencer, children under 13 are usually not permitted to have social media accounts. They cannot open bank accounts. So obviously their parents or guardian are typically the one running the show. That does not guarantee that a kid who makes a lot of money or is the star of the channel is ever going to see any of that money. But Illinois is making changes to its child labor law that will allow people 18 and over to sue if they were not properly compensated for content that they appeared in as children. Qualifying content must earn at least 10 cents per view. So we're not talking about vacation videos that your dad posts to like his private YouTube channel that four people see. It has to be monetized content and the child must appear in at least 30 percent of the accounts content over a 30 day period. Parents must put 50 percent of earnings into a trust fund based on the percentage of time the child appears in the video. So if a child appears in 50 percent of the video, they get 25 percent of the earnings. That is this new law. I guess as you're explaining this law, it upsets me that that's not already a thing. So this is only now in Illinois. Are there any other states where child influencers are protected? California and Washington have proposed similar laws when Illinois is the first. But some states do have similar protections. California, especially for child actors, the law in California is interesting. It's called Kugin law. It basically protects child actors to ensure that they get some of the money that they make ultimately from the TV shows and films and whatnot that they appear in. As children and it's actually named for this actor named Jackie Kugin, who you may know from playing Uncle Fester in the 1960s. Adams Family Show. Well, he was a big child actor and his mother and stepfather squandered his earnings and later in life, he was able to sue her to get some of that back. But in terms of Internet child influencers, this is very new that we're starting to put legislation in place to protect them. I understand why this is something that parents do. It's very lucrative. You noted that there are twin toddlers that made up to twenty thousand dollars per sponsored post. There's an 11 year old YouTuber that earns 25 million dollars or at least did in 2020. Yeah, he unboxes and reviews toys. That's his thing. I mean, good for him. But also, wow, this world. What I guess kind of shocks me in all of this is this is like a harmful practice for children. Yeah, I feel like it absolutely can be. You know, they really don't have the ability to consent to the way that they are depicted online. At the same time that I was reading about this law, I saw a bunch of posts about something called an egg crack challenge, which I watched way too many videos of this, something that I would typically not find entertaining. But in the interest of writing the story, I ended up going down this rabbit hole. And apparently all it is is a parent or someone older will be like, hey, we're making brownies together. And they'll say, I'm going to crack one egg and then you're going to crack the other. And then when they go to crack the other egg, instead of letting the child do it, they like smash it on their head, which in some cases does crack the egg and the kid laughs. But a lot of times the kids are really upset and they have a goop on their face and they do not enjoy it. And the mom is laughing and then post that on the Internet for however many people to see, which I don't really understand, I guess. Like I like cat videos. Yeah, things like this. You do something, a child has a very negative reaction and your first thought is cool. Let's post this on the Internet and make some money. Yeah. And then, you know, these kids are like four or five, you know, some of them are so young, they're not even potty trained. Right. I think this is something that as we look toward the future of this type of content, it's not going away. Especially when you have an 11 year old YouTuber making 25 million dollars. But how can we protect children? We're going to see so much more legislation, I imagine, coming through related to children and social media. And as someone who just would really love to not see children psychically tortured for entertainment, I'm glad that Illinois has made this first step. Be really interested to see if we can get other states to join them on this. There was an interesting Teen Vogue article I read. The girl's name, they gave her a fake name like Claire, but essentially she is someone whose entire life has been posted online. It is very lucrative. Apparently, when she got a little older, she told her parents that she did not want to be on YouTube anymore. She wanted to stop doing it. And she claims that they told her, well, if we do that, we're going to have to sell the house. We're not going to have money for nice things. That is their sole income is profiting off this child. And she told a reporter that she is waiting to turn 18, at which point she will speak out. And she's even considering going no contact with her parents because they just did not respect her right to privacy as a child. So I'm going to be curious to hear what these influencers have to say when they are adults. Just what every family needs more complication when their child turns 18. One group that's probably going to benefit from this when the children turn 18 is therapists. Oh, yeah. Talking to all these kids who their potty training was posted online for millions of people. That's going to do it for us today. Thank you for turning into the Hustle Daily Show. We're proud part of the HubSpot Podcast Network. Our editor today is Robert Hartwig and our executive producer is Darren Clark. We've g"}, "podcast_summary": "Good morning! In today's episode of the Hustle Daily Show, hosts Juliet Bennett-Ryla and Ben Berkeley discuss various news stories in the business and tech world. They mention the Associated Press publishing its standards for AI use, Blue Shield of California partnering with Mark Cuban's Cost Plus Drug Company and Amazon Pharmacy, the banning of TikTok on New York City government devices, In-N-Out owner Lindsay Snyder's new book on the high earnings of In-N-Out managers, the use of Google Maps by gig workers to mark tip baiters, and the naming of a new Peruvian snake species after actor Harrison Ford. The main story focuses on child influencers and a new law in Illinois that requires parents to pay their children for the content they create. The hosts discuss the impact of child influencers on children's well-being and consent, as well as the need for further legislation to protect them. They mention the lucrative earnings of child influencers and the potential psychological impact on these children as they grow older. The episode concludes by highlighting the therapy that may be needed for these children as they navigate their online presence and the complexities it brings to their relationships with their parents.", "podcast_guest": "Juliet Bennett-Ryla", "podcast_guest_details": "None", "podcast_highlights": "- Illinois has passed a new law that ensures child influencers get paid for their content.\n- The law allows people 18 and over to sue if they were not properly compensated for content they appeared in as children.\n- Qualifying content must earn at least 10 cents per view and the child must appear in at least 30% of the content over a 30-day period.\n- Parents must put 50% of earnings into a trust fund based on the percentage of time the child appears in the video.\n- California and Washington have proposed similar laws, but Illinois is the first to pass it.\n- The practice of child influencers can be harmful as children do not have the ability to consent to their online depiction.\n- Legislation to protect children in the world of social media is expected to increase in the future."}