{"podcast_details": {"podcast_title": "Let's Talk Future™", "episode_title": "The Great Supply Chain Reversal", "episode_image": "https://deow9bq0xqvbj.cloudfront.net/image-logo/8010381/letstalkfuture.jpg", "episode_transcript": " Hello, you're listening to the Let's Talk Future podcast series presented by Oppenheimer. If you're interested in the economy, markets, and investing in general, you've come to the right place. This series was created to fascinate and enlighten every type of investor. Curious about the latest consumer trends? How about innovations in healthcare or technology? The Let's Talk Future series definitely has you covered. Through timely and relevant conversations, we deliver some of the best thought leadership in the financial services industry. Our renowned hosts and guests explore big questions and big ideas and leave you with actionable insights. In this episode, our featured guest is Fred Larsen, Managing Director and Head of Oppenheimer's Transportation and Logistics Investment Banking Team. And our host is Jane Ross, Managing Director of Investment Banking at Oppenheimer. This episode was recorded on July 25th, 2023. Thank you for joining us. Welcome to our episode called The Great Supply Chain Reversal. I'm your host, Jane Ross, and we're here with Fred Larsen, the Managing Director who heads Oppenheimer's Transportation and Logistics Investment Banking Team. Fred and I did an episode early in COVID when problems in the global supply chain were a big, big topic. Now we have major changes on the other side. The largest US trucking company, Yellow, has signaled their intention to file for bankruptcy as of this recording. The airlines are having a manic summer with super strong bookings, but rampant and significant flight delays due to weather, but also logistical issues. The Inflation Reduction Act passed with major implications for Fred's companies and the US economy. So here we are. And let's go. Welcome back, Fred Larsen. Thank you, Jane Ross. It's great to be back. I was looking at my notes and we last spoke a little over three years ago. It seems like an eternity. It was a different world. So I'm going to ask you to bring us up to date, which is pretty broad. But if you could bring us up to date on some of the big thematic things that have changed for your space since we last spoke. The big theme that we start with is that the pandemic is still having major ripple effects in my space. It was such a massive disruption to global supply chains and it was unusual because it happened all at once everywhere, which messed things up royally and made it very, very difficult for people to recover from. And so there was a lot of volatility well through the pandemic extending into 2021 and 2022 where transportation providers, transportation users were trying to adjust and adapt. You had many manufacturers and retailers who were panicking that they didn't have enough materials and goods to sell to consumers during the pandemic. So they tended to overreact in the other direction and stock a lot more inventory in their supply chains. But unfortunately, when consumer spending slowed down, that meant that they now had overstuffed warehouses and were able to ship less and sell less and so forth. So you've had quite a lot of volatility, which is reflected most directly in the transportation market in the freight shipping rates across the different modes. And we've seen a lot of volatility in those spaces. One of the most dramatic ones was what happened in ocean shipping. When you think about the containers that get moved across the ocean from Asia to the US and Europe to the US and vice versa, it's a huge global trade. And it's the vast bulk in terms of volume of actual goods that gets moved by transportation around the world. For many years and right up until the beginning of the pandemic, the typical rate for container to be shipped across the ocean was about $2,000 by the time of and that was all the way up until May of 2020. It was actually trading below $2,000. By 2021, actually in September, it had climbed over $10,000 to ship a container across the ocean. So five times more than five times increase, massive, massive change in volatility. And then in 2022, in March, it began falling at a steady rate. And now it's actually back down to under $2,000. So that's a tremendous volatility. The beneficiaries of that, of course, in the transportation space were the big ocean going shipping companies, the Maersks of the world, the CMA, CGM, the Hapag Lloyds, those kinds of companies, which typically trade on the European markets, not here. But they all made so much money, they made more money in that period of time, about a year, year and a half than I think they had made the decades before that. And they're sitting on huge amounts of cash that they're now using, in fact, to try and differentiate or diversify across the space. So the ocean shipping rates are a very good example of how volatility hit the space. It went spiked it up really high, and now it's come back really far back down, almost to normal in many ways, if not slightly below normal. And you see the same thing in trucking markets. You see the same things in warehouse servicing markets. You see things all across the supply chain where the similar kind of behavior has happened. And we'll get to it later, but you're seeing an analogous spike in terms of demand, although on a lagged basis in the passenger aviation market. OK, so and I know another thing that we talked about in our last episode was about supply chains being engineered for perfection, and that was a real risk to the system. So we've seen now an attempt to diversify into other geographies, right? That's been ongoing. Very much so, yes. What happened, as we discussed, was the manufacturers and shippers of the global supply chains realized they'd over-optimized their supply chains. They had too much single sourcing far away, mostly in China, because the lowest cost of manufacturing was still mostly in China for most companies. And that required very long extended supply chains and made them very fragile. So they were easy to break, and they did break in the pandemic, and they were very hard to repair. So what manufacturers and retailers who do have global supply chains have been doing ever since has been diversifying their supply chain. They've been nearshoring. They've been bringing manufacturing closer to shore, closer to their destination, to consumer markets. They've been on-shoring. They've been multi-sourcing. So instead of having one supplier, let's say, in Shenzhen province, they're going to have three or four scattered around Asia, maybe even Mexico or even Europe, parts of Eastern Europe. So you've seen quite a bit of diversity. That has direct effects as well on the freight movements and the freight markets. And one of the interesting things, one of the nice and well-performing parts of the supply chain right now, if you're in the transportation business, is actually the Mexican market. Mexico, frankly, is on fire. All those maquilladoras that were built around the time of the original building of the maquilladoras down there are being reactivated, are being built on to, improved, upgraded, and filled with manufacturing. So you're seeing a great deal of cross-border transportation in Mexico right now, and that's reflecting in the bottom lines of the companies that serve it. Okay. So we're building a little bit of a constructive base here. We have pricing reverting back to normal, but more predictable now because we have that data. We have some geographic diversity. Another issue that I cannot do an episode without referencing is AI and technology. And I know predictive AI is very pertinent for your companies. So that's something that's happening too. Absolutely. Yes. The change in the technology market and technology impact on transportation has been quite dramatic as we've seen change in the technology market across the entire industry and economy. What's happened in transportation is that there's been continued technological innovation across the board. A lot of companies have been working directly and or indirectly on both artificial intelligence, machine learning, predictive analytics, data mining, call it what you will. It all sort of combines into a way to essentially create very sophisticated tools to try and predict where the demand is coming from next, as well as how you should manage the transportation of goods and services to your consumers. So it's continued to be a very important part of the market. And if anything, you're seeing some strength in that sector, whereas in, let's say, other parts of the technology market that serve consumers, set spaces or other spaces, there might be weakness. And that could be a bit of a margin enhancer or a cost demiser, right? So that's interesting. Okay. Another big theme, got to bring up the Inflation Reduction Act. That passed, I think money is starting to flow out there that there's big implications for your companies. So spend a couple of minutes on that, who's going to benefit, stuff like that. Yeah. Well, the Inflation Reduction Act was pretty amazing thing. And what's interesting is it's not the only one. It's one of actually three major spending bills that Congress and the president have put into work in the last few years. And over the next 10 years, they combine to over $2 trillion of government spending, subsidies and support to various infrastructure and infrastructure oriented expenditures. When it impacts on transportation, obviously building infrastructure, building roads, building bridges, building all those kinds of things, direct impact on the efficiency and the operating abilities of transportation companies. It's also a lot of indirect things. One of the interesting provisions in the IRA, the Inflation Reduction Act, was the implementation of direct support and incentives for electric vehicles, which of course we all know is in a major and growing trend in this country, certainly is in many other countries as well. And I think we should continue to see a lot of activity in that space. Right. Okay. Well, let's delve to some of t"}, "podcast_summary": "In this episode of the Let's Talk Future podcast series presented by Oppenheimer, the host Jane Ross interviews Fred Larsen, the Managing Director and Head of Oppenheimer's Transportation and Logistics Investment Banking Team. They discuss the major changes in the global supply chain and transportation industry since their last conversation during the COVID-19 pandemic. Larsen explains the volatility in freight shipping rates, such as the significant increase in ocean shipping rates and the subsequent decrease. He also discusses the diversification of supply chains, with manufacturers and retailers near-shoring, on-shoring, and multi-sourcing to reduce fragility and improve efficiency. Larsen highlights the growth of the Mexican market and the impact of technological innovation, such as AI, machine learning, and predictive analytics, on the transportation industry. Finally, they touch on the Inflation Reduction Act and its implications for transportation companies, including infrastructure investments and incentives for electric vehicles.", "podcast_guest": {"name": "Fred Larsen", "summary": "The Ontario Liberal Party is one of three major political parties in Ontario, Canada running in the 2011 Ontario provincial election. The Ontario Liberals have governed the province since 2003, and currently forms a minority government in the Legislative Assembly of Ontario with 47 out of 107 seats.\n\n"}, "podcast_highlights": "- The podcast series is called Let's Talk Future and is presented by Oppenheimer.\n- The series covers topics related to the economy, markets, and investing.\n- The featured guest in this episode is Fred Larsen, Managing Director and Head of Oppenheimer's Transportation and Logistics Investment Banking Team.\n- The episode discusses the major changes and ripple effects of the pandemic on the transportation and logistics industry.\n- It mentions the bankruptcy of the largest US trucking company, Yellow, and the issues faced by airlines with flight delays and logistical problems.\n- The Inflation Reduction Act is highlighted as a major development with implications for transportation companies and the US economy.\n- The podcast explores the effects of the pandemic on global supply chains, volatility in freight shipping rates, and efforts to diversify supply chains into other geographies.\n- It also discusses the role of AI and technology in the transportation industry, particularly in predictive AI, and the impact of the Inflation Reduction Act on infrastructure and electric vehicles.\n\nIn summary, the highlights include the challenges caused by the pandemic on supply chains and transportation, the bankruptcy of Yellow, flight delays and logistical issues faced by airlines, the Inflation Reduction Act and its impact on the industry, efforts to diversify supply chains, the role of AI and technology in transportation, and the focus on infrastructure and electric vehicles."}